tomato_case_CO2sink/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version: 10                                     |
|   \  /    A nd           | Website:  https://openfoam.org                  |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    "tomato_plant.stl"
    {
        type triSurfaceMesh;
        name tomato;
        scale 1.0;
    }
}

castellatedMeshControls
{
    maxLocalCells 1000000;
    maxGlobalCells 2000000;
    minRefinementCells 10;
    nCellsBetweenLevels 3;

    features 
    (
        {
            file "tomato_plant.eMesh";
            level 2;
        }
    );

    refinementSurfaces
    {
        tomato
        {
            level (2 2);
        }
    }

    refinementRegions {}

    locationInMesh (0.1 0.1 0.1);

    allowFreeStandingZoneFaces true;

    resolveFeatureAngle 30;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
}

addLayersControls
{
    relativeSizes true;
    layers
    {
        tomato
        {
            nSurfaceLayers 1;
        }
    }
    expansionRatio 1.0;
    finalLayerThickness 0.3;
    minThickness 0.1;
    nGrow 0;
    featureAngle 60;
    slipFeatureAngle 30;
    nRelaxIter 5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls 
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minFlatness 0.5;
    minVolRatio 0.01;
    minTetQuality 1e-9;
    minAreaFace 1e-13;
    minTwist 0.05;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolWeight 0.05;
    minTriangleTwist -1;
    minEdgeLength 1e-9;
    nSmoothScale 4;
    errorReduction 0.75;
    minVol 1e-13;
}

mergeTolerance 1e-6;