tomato_case_CO2sink/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version: 10                                     |
|   \  /    A nd           | Website:  https://openfoam.org                  |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
simulationType  RAS;
transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] {nu};  // Kinematic viscosity (m^2/s)
rho             rho [ 1 -3 0 0 0 0 0 ] 1.225;   // Density (kg/m^3)

RAS
{
    RASModel        kEpsilon;
    turbulence      on;
    printCoeffs     on;
}