tomato_case_CO2sink/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version: 10                                     |
|   \  /    A nd           | Website:  https://openfoam.org                  |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
transportModel  Newtonian;
nu nu [0 2 -1 0 0 0 0] 1.8e-05; // Kinematic viscosity (m^2/s)
rho             rho [ 1 -3 0 0 0 0 0 ] 1.225;   // Density (kg/m^3)
D_CO2 D_CO2 [0 2 -1 0 0 0 0] 1.6e-05; // Diffusivity of CO2 (m^2/s)
DT              DT [ 0 2 -1 0 0 0 0 ] 1.0e-05;  // Thermal diffusivity (m^2/s)