tomato_case_CO2sink/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version: 10                                     |
|   \  /    A nd           | Website:  https://openfoam.org                  |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0.5 0 0);

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform (0.5 0 0);
    }
    outlet
    {
        type zeroGradient;
    }
    top
    {
        type noSlip;
    }
    bottom
    {
        type noSlip;
    }
    sides
    {
        type noSlip;
    }
    tomato
    {
        type noSlip;
    }
}