tomato_case_CO2sink/0/CO2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version: 10                                     |
|   \  /    A nd           | Website:  https://openfoam.org                  |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      CO2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 0 0 0 0 0 0];
internalField   uniform 400;

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform 400;
    }
    outlet
    {
        type zeroGradient;
    }
    top
    {
        type zeroGradient;
    }
    bottom
    {
        type zeroGradient;
    }
    sides
    {
        type zeroGradient;
    }

    tomato
    {
        type fixedGradient;
        gradient uniform -15290.02652356279;  // CO2 sink: negative value. Adjust the value to represent the sink strength
        // type fixedValue;
        // value uniform 200;
    }
}